import streamlit as st
from sqlalchemy import create_engine, MetaData, Table, Column, String, insert
from typing import Optional

# Write to database
def add_to_database(
        target_table_name: str,
        tsd: str,
        ell: str,
        author: Optional[str] = None
    ):
    """
    Adds a new record to the specified database table using provided values.

    Args:
        target_table_name (str): Name of the target table to insert into.
        tsd (str): Tsakonian text to store.
        ell (str): Greek text to store.
        author (str, optional): Author name. Defaults to None.
    """

    try:
        # Establish connection using Streamlit's connection
        conn = st.connection("neon_db", type="sql")

        # Define table metadata
        metadata = MetaData()
        
        # --- Define the dictionary table schema ---
        # No need to define 'id' column manually as it will be auto-incremented by PostgreSQL
        target_table = Table(
            target_table_name,
            metadata,
            Column("tsd", String),
            Column("ell", String),
            Column("author", String, nullable=True),
        )
        
        # Create the insert statement
        stmt = insert(target_table).values(tsd=tsd, ell=ell, author=author)

        # Execute the insert statement and commit the transaction
        with conn.session as session:
            session.execute(stmt)
            session.commit()

        st.success("Η εγγραφή προστέθηκε με επιτυχία! 🎉")

    except Exception as e:
        st.error(f"Παρουσιάστηκε σφάλμα: {e}")
        st.write("Debug: Λεπτομέρειες εξαίρεσης:", e)

# Use st.cache_data to cache the query results
@st.cache_data(ttl=600)
def get_top_contributors():
    """
    Retrieves the top 10 contributors from both dictionary_contributions and texts_contributions tables.

    Returns:
        Query result containing author names and their number of contributions.
    """
    conn = st.connection("neon_db", type="sql")
    # Query both tables and combine the results to get the total contributions
    result = conn.query("""
        SELECT author, COUNT(*) as n_contributions
        FROM (
            SELECT author FROM dictionary_contributions WHERE author IS NOT NULL
            UNION ALL
            SELECT author FROM texts_contributions WHERE author IS NOT NULL
        ) AS combined_contributions
        GROUP BY author
        ORDER BY n_contributions DESC
        LIMIT 10
        """)
    return result

# Orthographic norms explanation
orthographic_norms_explanation = """
# Ορθογραφικοί κανόνες

Αφού στα Τσακώνικα δεν υπάρχουν αυστηροί ορθογραφικοί κανόνες, στο πλαίσιο του έργου μας, χρησιμοποιούνται δύο οργογραφικοί κανόνες:

* **Ορθογραφία του Θανάση Κωστάκη**: προσαρμοσμένη στην Τσακώνικη φωνητική με διακριτικά σύμβολα. Απαιτεί ειδικά τεχνικά μέσα που μπορείτε να βρείτε [εδώ](https://tsakoniandigital.com/dictionary/writing_extension/).
* **Ορθογραφία του Πάνου Μαρνέρη**: εύκολη για μη-τεχνικούς χρήστες με ευρεία χρήση στα έργα τους.

## Ποια να επιλέξω;

* Εαν είναι η πρώτη φορά που ασχολείστε με τα Τσακώνικα, προτείνουμε την ορθογραφία του Πάνου Μαρνέρη για ευκολία στη χρήση.
* Εαν έχετε εμπειρία με την Τσακώνικη γλώσσα και επιθυμείτε μεγαλύτερη ακρίβεια, μπορείτε να δοκιμάσετε την ορθογραφία του Θανάση Κωστάκη.

Αυτή η εφαρμογή υποστηρίζει και τις δύο ορθογραφίες, επιτρέποντάς σας να επιλέξετε αυτή που σας ταιριάζει καλύτερα.

## Εισαγωγή στις ορθογραφικές κανόνες

### Ορθογραφία του Πάνου Μαρνέρη

* Η δασύς _κ_ γράφεται **κχ**, π.χ. _κχάρα_ (_φωτιά_).
* Η δασύς _τ_ γράφεται **τθ**, π.χ. _τ̔θαίνου_ (_σηκώνω_).
* Η δασύς _π_ γράφεται **πφ**, π.χ. _επφέρι_ (_χθες_).
* Η ήχος _sh_ από τα Αγγλικά γράφεται **ςh**. Στην εφαρμογή μας, για την ευκολία χρήσης, μπορείτε να γράψετε και **ξξ**, π.χ. _ςhίνα_ ή _ξξίνα_ (_βουνό_).
* Η ήχος _zh_ από τα Γαλλικά _j'aime_ γράφεται **ζh**. Στην εφαρμογή μας, για την ευκολία χρήσης, μπορείτε να γράψετε και **ζζ**, π.χ. _κάζhυ_ ή _κάζζυ_ (_καρύδι_).

Ειδική προσοχή θέλει η γραφή του _ν_ πριν _ι_:

* Εάν προσφέρετε όπως στην λέξη  _εννιά_, γράφετε **νν**: π.χ. _εζού έννι_ (_εγώ είμαι_).
* Αλλιώς, γράφετε **ν**: π.χ. _έντανη_ ένι ο αφέγκη μι_ (_αυτός είναι ο πατέρας μου_).

Τα ρήματα που λήγουν σε -γγου για στην ορθογραφία του Κωστάκη γράφονται με **-γκου**: π.χ. _έγκου_ (_πάω_), _δουλέγκου_ (_δουλεύω_).

### Ορθογραφία του Θανάση Κωστάκη

* Η δασύς _κ_ γράφεται **κ̔**, π.χ. _κ̔αρα_ (_φωτιά_).
* Η δασύς _τ_ γράφεται **τ̔**, π.χ. _τ̔αίνου_ (_σηκώνω_).
* Η δασύς _π_ γράφεται **π̔**, π.χ. _επ̔έρι_ (_χθες_).
* Η ήχος _sh_ γράφεται **σ̌**, π.χ. _σ̌ίνα_ (_βουνό_).
* Η ήχος _zh_ γράφεται **ζ̌**, π.χ. _κάζ̌υ_ (_καρύδι_).
* Ο ήχος _ts_ γράφεται **τ͡σ**, π.χ. _τ͡σαι_ (_και_).

Ειδική προσοχή θέλει η γραφή του _ν_ και _λ_ πριν _ι_:

* Το _ν_ πριν από φωνήεν με ήχο [i] (ι, υ, ει, οι...) γράφεται **ν̇** αν προφέρεται [ni], π.χ. _έν̇ι_ (_είμαι_). Αν προφέρεται [ɲ], γράφεται **ν̂'**, π.χ. _ν̂'επέκα_ (_τον είπα_).
* Το _λ_ πριν από φωνήεν με ήχο [i] γράφεται **λ̣** αν προφέρεται [li], π.χ. _κάλ̣ι_ (_ξύλο_). Αν προφέρεται [ʎ], γράφεται **λι**, π.χ. _αλλιά_ (_αλλού_).

Τα ρήματα που λήγουν σε -γκου για στην ορθογραφία του Μαρνέρη γράφονται με **-γγου**: π.χ. _έγγου_ (_πάω_), _δουλέγγου_ (_δουλεύω_).

### Δείγμα συγκρίσης κειμένων

| Κωστάκης | Μαρνέρης | Μαρνέρης (μόνο με Ελληνικές χαρακτήρες) | Νέα Ελληνικά |
|---|---|---|---|
| Έμε νία ατσ̌ά φανίλια. Ο παππού, α μαμού, ο αφέγκη, α μάτη, δυ αθήνε ατσ̌υτέροι από σ' ενίου, εζού τ͡σαι νια αθιά μιτσουτέρα μι. | Έμε ννία ατςhά φανίλια. Ο παππού, α μαμού, ο αφέγκη, α μάτη, δυ αθήνε ατςhυτέροι από σ’ εννίου, εζού τσαι ννία αθιά μιτσουτέρα μι. | Έμε ννία ατξξά φανίλια. Ο παππού, α μαμού, ο αφέγκη, α μάτη, δυ αθήνε ατξξυτέροι από σ’ εννίου, εζού τσαι ννία αθιά μιτσουτέρα μι. | Έχω μία μεγάλη οικογένεια. Ο παππούς, η γιαγιά, ο πατέρας, η μάνα, δυο αδερφια μεγαλύτεροι από εμένα, εγώ και μία αδελφή μικρότερη μου. |
| Ο παππού τ͡σαι α μαμού εγεράκαϊ. Οι τσ̌ίχε σου ελεκαρίαϊ. Οι όντου σου ετσιτάν̇ι. Είνι φορούντε γυαλία. Ούνι ορούντε κα. | Ο παππού τσαι α μαμού εγεράκαει.  Οι τςhίχε σου ελεκαρίαει. Οι όντου σου ετσιτάνει. Είννι φορούντε γυαλία. Ούννι ορούντε κα. | Ο παππού τσαι α μαμού εγεράκαει.  Οι τξξίχε σου ελεκαρίαει. Οι όντου σου ετσιτάνει. Είννι φορούντε γυαλία. Ούννι ορούντε κα. | Ο παππούς και η γιαγιά γέρασαν. Τα μαλλιά του άσπρισαν. Τα δόντια τους έπεσαν. Δεν βλέπουν καλά. |
| Τα καμπζία είνι έγγουντα το σχολείε. Ο αφέγκη όα ταν αμέρα έν̇ι δουλέγγου του χούρε. Α μάτη εμποία όλ̣οι του δουλ̣είε τα τ͡σελ̣ή. Έν̇ι μαγερέγγα, έν̇ι σκουπίζα, έν̇ι κ̇ρύζα, έν̇ι ποκίχα τα λουλούδια, έν̇ι ταγίχα του κότ̇ε. | Τα καμπζία είννι έγκουντα το σχολείε. Ο αφέγκη όα ταν αμέρα ένι δουλέγκου του χούρε. Α μάτη εμποία όλοι του δουλείε τα τσελή. Ένι μαγερέγκα, ένι σκουπίζα, ένι κχρύζα, ένι ποκίχα τα λουλούδια, ένι ταγίχα του κότθε. | Τα καμπζία είννι έγκουντα το σχολείε. Ο αφέγκη όα ταν αμέρα ένι δουλέγκου του χούρε. Α μάτη εμποία όλοι του δουλείε τα τσελή. Ένι μαγερέγκα, ένι σκουπίζα, ένι κχρύζα, ένι ποκίχα τα λουλούδια, ένι ταγίχα του κότθε. | Τα παιδία πάνε στο σχολείο. Ο πατέρας όλη την ημέρα δουλεύει στα χωράφια. Η μάνα κάνει όλες τις δουλειές του σπιτιού. Μαγειρεύει, σκουπίζει, πλύνει, ποτίζει τα λουλούδια, ταΐζει τις κότες. |
"""